// 1)რა განსხვავებაა let, const შორის?
//-- let ცვლადის მნიშვნელობის შეცვლა შესაძლებელია, კონსტანტასთვის მინიჭებული მნიშვნელობის შეცვლა შეუძლებელია,
//მაგრამ const-ით ობიექტის ან მასივის შექმნის შემთხვევაში, შიგთავსის შეცვლა შესაძლებელია

// 2)რა განსხვავებაა primitive და nonprimitive type-ებს შორის?
//--Primitive ტიპები (string,number, boolean,null, undefined ...)ინახავენ უშუალოდ მნიშვნელობას და ამ მნიშვნელობის შეცვლისას
//ძველი არ იშლება, არამედ ახალი იქმნება
// nonprimitive ტიპები (ობიექტი, ფუნქცია, ერეი ) ინახავენ არა მნიშვნელობას, არამედ მისამართს

// 3)რა განსხვავებაა == და === ოპერატორებს შორის?
//-- '==' - არის არამკაცრი შედარება და ადარებს მხოლოდ მნიშვნელობებს
//-- '===' - არის მკაცრი შედარება და ადარებს როგორც მნიშვნელობებს ასევე მონაცემების ტიპს

// 4)რა ტიპის არის null
//--typeoff null-ის შემთხვევაში ჯავასკრიპტი აბრუნებს ობიექტს, თუმცა ეს ძველი ბაგია, რომლის გასწორებაც მეტ პრობლემას შექმნიდა და
// ამიტომ ასე დატოვეს, ლოგიკურად Null არის ცალკე პრიმიტიული ტიპი, რომელიც მნიშვნელობის არ არსებობას აღნიშნავს

// 5)რა განსხვავებაა funtion და = () => {} შორის
//-- ჩვეულებრივ ფუნქციას აქვს თავისი this. Arrow ფუნქციას საკუთარი this არ გააჩნია, ის მას იღებს იმ გარემოდან, სადაც შეიქმნა
//ჩვეულებრივ ფუნქციას შიგნით აქვს წვდომა arguments მასივზე, ისრიან ფუნქციას კი არა
//arrow function არ შეიძლება გამოყენებულ იქნას constructor-ად

// 6)რას ნიშნავს callback function?
//--კოლბექი არის ფუნქცია, რომელიც გადაეცემა სხვა ფუნქციას არგუმენტად და 
// რომელიც უნდა გამოიძახონ მოგვიანებით, გარკვეული მოქმედების დასრულების შემდეგ

// 7)რა განსხვავებაა map, filter და reduce-ს შორის?
//--map გარდაქმნის მასივის თითოეულ ელემენტს და აბრუნებს ახალ მასივს იმავე ზომით 
// filter ფილტრავს მასივს გარკვეული პირობით და აბრუნებს ახალ მასივს, სადაც მხოლოდ ის ელემენტებია რომლებმაც პირობა დააკმაყოფილეს. 
// reduce იღებს მასივის ყველა ელემენტს და მათზე მანიპულაციით აბრუნებს ერთ კონკრეტულ საბოლოო მნიშვნელობას.

// 8)რა არის Promise?
//--Promise არის ობიექტი, რომელიც წარმოადგენს ასინქრონული ოპერაციის საბოლოო შედეგს (წარმატებას ან წარუმატებლობას). აქვს 3 მდგომარეობა 
// Pending: მოლოდინი (ოპერაცია ჯერ არ დასრულებულა)
//  Fulfilled: წარმატებით დასრულდა (აბრუნებს შედეგს, რასაც .then()-ით ან await-ით ვიჭერთ). 
// Rejected: დასრულდა შეცდომით (ვიჭერთ .catch()-ით).


// 9)რა განსხვავებაა Promise.all, Promise.race და Promise.any-ს შორის?
//--Promise.all: ელოდება ყველა ფრომისის წარმატებით დასრულებას. თუ რომელიმე ერთი მაინც "ჩავარდა", მთლიანი პროცესი ჩავარდნილად ითვლება
//Promise.race: აბრუნებს იმ ფრომისის შედეგს, რომელიც ყველაზე სწრაფად დასრულდება 
// (სულ ერთია, წარმატებით დასრულდება თუ შეცდომით). ვინც პირველი მივა ფინიშთან, ის იმარჯვებს.
//Promise.any: ელოდება პირველს, რომელიც წარმატებით დასრულდება. შეცდომებს აიგნორებს, სანამ ერთი მაინც არ შესრულდება წარმატებით

// 10)რას ნიშნავს async/await და რატომ ვიყენებთ?
//-- გამოიყენება კოდის უფრო მარტივად და readable-ად დასაწერად, callback hell-ის თავიდან ასარიდებლად
//async ფუნქციაში ვამბობთ, რომ ამ ფუნქციის შიგნით ასინქრონული პროცესები მოხდება
//await აჩერებს async ფუნქციის შიგნით არსებული კოდის შესრულებას, სანამ Promise არ დასრულდება

// 11)რა განსხვავებაა class-სა და object-ს შორის?
//--კლასი არის შაბლონი, ნახაზი.ის თავად არ არის მონაცემი,ის უბრალოდ განსაზღვრავს თუ რა თვისებები და მეთოდები უნდა ჰქონდეს მისგან შექმნილ ობიექტს
//ობიექტი არის კონკრეტული ეგზემპლარი,მას აქვს რეალური მონაცემები მეხსიერებაში.

// 12)რას აკეთებს constructor class-ში?
//--კონსტრუქტორი არის სპეციალური მეთოდი კლასის შიგნით,რომლის გამოძახებაც ავტომატურად ხდევა ახალი ობიექტის შექმნის მომენტში
//მისი მთავარი დანიშნულება ობიექტისთვის საწყისი თვისებების,პარამეტრების მინიჭებაა.

//13)რა განსხვავებაა მემორი ჰიპსა და მემორი სტექკს შორის
//--ეს არის მეხსიერების ორი სხვადასხვა ნაწილი, სადაც ჯავასკრიპტი ინახავს მონაცემებს
//--სტეკი სწრაფი და ორგანიზებული მეხსიერებაა.აქ ინახება პრიმიტიული ტიპები და არაპრიმიტიული ტიპების მისამართები. 
// მუშაობს Last In, First Out პრინციპით
//--ჰიპი დიდი და არასტრუქტურირებული მეხსიერების არეალია.აქ ინახება არაპრიმიტიული (კომპლექსური) ობიექტები და მასივები,
//  რადგან მათ წინასწარ განსაზღვრული ზომა არ აქვთ და შეიძლება გაიზარდონ.


//14) რა არის ქოლსტეკი
//--ქოლსტეკი არის მექანიზმი,რომელსაც ჯავასკკრიპტი იყენებს იმის დასამახსოვრებლად,თუ კოდის რომელ ნაწილში იმყოფება ამჟამად.
// რომელი ფუნქცია სრულდება ახლა და რომელი ფუნქციებიდან იქნა ის გამოძახებული. ვინაიდან JavaScript არის Single-threaded, 
// მას აქვს მხოლოდ ერთი ქოლსტეკი.რაც ნიშნავს, რომ მას დროის ერთ მომენტში მხოლოდ ერთი დავალების შესრულება შეუძლია.

//15) რა არის ივენთ ლუპი
//--ივენთ ლუპი არის მუდმივად მომუშავე მექანიზმი,რომელიც აკავშირებს ერთმანეთთან Call Stack-ს, ბრაუზერის გარემოს და ასინქრონული დავალებების რიგს
//მიუხედავად იმისა,რომ JavaScript ერთნაკადიანია და ქოლსტეკში ყველაფერს სათითაოდ ასრულებს,ჩვენ მაინც შეგვიძლია ასინქრონული ოპერაციების გაკეთება 
// ივენთ ლუპის დამსახურებით.
